Repository: FredrikBorgstrom/smart_arb_translator
Catalog: lib/l10n_cache/l10n/intl_*.arb
Languages: es, fr, ja

# appTitle
source: Smart ARB Translator Demo
es: Demostración del traductor ARB inteligente
fr: Démo du traducteur Smart ARB
ja: スマートARBトランスレータのデモ

source: Change Language
es: Cambiar idioma
fr: Changer de langue
ja: 言語を変更

# commonVehicleType
source: {vehicleType, select, sedan{Sedan} cabriolet{Solid roof cabriolet} truck{16 wheel truck} other{Other}}
es: {vehicleType, select, sedan{Después} cabriolet{descapotable de techo sólido} truck{camión de 16 ruedas} other{Otro}}

# currentLanguage
source: Current language: {language}
es: Idioma actual: {language}
fr: Langue actuelle : {language}
ja: 現在の言語: {language}

# dartCodeGen
source: Dart Code Generation
es: Generación de código Dart
fr: Génération de code Dart
ja: Dartコード生成

# dartCodeGenDesc
source: Automatically generates type-safe Dart localization code
es: Genera automáticamente un código de localización de Dart seguro para tipos
fr: Génère automatiquement du code de localisation Dart de type sécurisé
ja: 型安全なDartローカリゼーションコードを自動生成します

source: Features
es: Características
fr: Caractéristiques
ja: 特徴

source: Flutter Integration
es: Integración de Flutter
fr: Intégration Flutter
ja: Flutter統合

# flutterIntegrationDesc
source: Seamless integration with Flutter's internationalization workflow
es: Integración perfecta con el flujo de trabajo de internacionalización de Flutter
fr: Intégration transparente avec le flux de travail d'internationalisation de Flutter
ja: Flutterの国際化ワークフローとのシームレスな統合

# generatedAt
source: Generated at: {timestamp}
es: Generado en: {timestamp}
fr: Généré à : {timestamp}
ja: 生成日時: {timestamp}

# greetUser
source: Hello, {name}!
es: Hola, {name} !
fr: Bonjour, {name} !
ja: こんにちは、 {name} ！

# itemCount
source: {count,plural, =0{No items} =1{One item} other{{count} items}}
es: {count,plural, =0{No hay artículos} =1{One item} other{{count} items}}
fr: {count,plural, =0{Aucun article} =1{One item} other{{count} items}}
ja: {count,plural, =0{アイテムなし} =1{One item} other{{count} items}}

# pageHomeBirthday
source: {sex, select, male{His birthday} female{Her birthday} other{Their birthday}}
es: {sex, select, male{Su cumpleaños} female{Su cumpleaños} other{su cumpleaños}}

# pageHomeInboxCount
source: {count, plural, zero{You have no new messages} one{You have 1 new message} other{You have {count} new messages}}
es: {count, plural, zero{No tienes mensajes nuevos} one{Tienes 1 mensaje nuevo} other{Tienes {count} mensajes nuevos}}

# pageHomeTitle
source: Welcome {firstName}
es: Bienvenido {firstName}

# pageLoginPassword
source: Your password
es: Tu contraseña

# pageLoginUsername
source: Your username
es: Su nombre de usuario

source: Smart Translation
es: Traducción inteligente
fr: Traduction intelligente
ja: スマート翻訳

# smartTranslationDesc
source: Only translates new or changed content, saving API costs
es: Solo traduce contenido nuevo o modificado, ahorrando costos de API
fr: Traduit uniquement le contenu nouveau ou modifié, ce qui permet de réduire les coûts d'API
ja: 新規または変更されたコンテンツのみを翻訳し、API コストを節約します

# specialGreeting
source: Welcome to the future of Flutter i18n!
es: ¡Bienvenido al futuro de Flutter i18n!
fr: Bienvenue dans le futur de Flutter i18n !
ja: Flutter i18n の未来へようこそ!

# subtitle
source: Experience seamless internationalization with automatic Dart code generation
es: Experimente una internacionalización perfecta con la generación automática de código Dart
fr: Bénéficiez d'une internationalisation transparente grâce à la génération automatique de code Dart
ja: 自動 Dart コード生成によるシームレスな国際化を体験

# testCompleted
source: Translation test completed successfully!
es: ¡Prueba de traducción completada exitosamente!
fr: Test de traduction terminé avec succès !
ja: 翻訳テストが正常に完了しました。

# welcome
source: Hello
es: Hola

# welcomeMessage
source: Welcome to Smart ARB Translator!
es: ¡Bienvenido a Smart ARB Translator!
fr: Bienvenue sur Smart ARB Translator !
ja: Smart ARB Translator へようこそ!
