Repository: FredrikBorgstrom/smart_arb_translator
Catalog: lib/l10n/intl_*.arb
Languages: de

# appTitle
source: Smart ARB Translator Demo
de: Demo des Smart ARB-Übersetzers

source: Change Language
de: Sprache ändern

# commonVehicleType
source: {vehicleType, select, sedan{Sedan} cabriolet{Solid roof cabriolet} truck{16 wheel truck} other{Other}}
de: {vehicleType, select, sedan{Dann} cabriolet{Solid roof cabriolet} truck{16 wheel truck} other{Other}}

# currentLanguage
source: Current language: {language}
de: Aktuelle Sprache: {language}

# dartCodeGen
source: Dart Code Generation
de: Dart-Codegenerierung

# dartCodeGenDesc
source: Automatically generates type-safe Dart localization code
de: Automatisch typsicheren Dart-Standortcode generieren

source: Features
de: Merkmale

# flutterIntegrationDesc
source: Seamless integration with Flutter's internationalization workflow
de: Nahtlose Integration in den Internationalisierungs-Workflow von Flutter

# generatedAt
source: Generated at: {timestamp}
de: Generiert am: {timestamp}

# greetUser
source: Hello, {name}!
de: Hallo, {name} !

# itemCount
source: {count,plural, =0{No items} =1{One item} other{{count} items}}
de: {count,plural, =0{Keine Artikel} =1{One item} other{{count} items}}

# pageHomeBirthday
source: {sex, select, male{His birthday} female{Her birthday} other{Their birthday}}
de: {sex, select, male{Sein Geburtstag} female{Her birthday} other{Their birthday}}

# pageHomeInboxCount
source: {count, plural, zero{You have no new messages} one{You have 1 new message} other{You have {count} new messages}}
de: {count, plural, zero{Sie haben keine neuen Nachrichten} one{You have 1 new message} other{You have {count} new messages}}

# pageHomeTitle
source: Welcome {firstName}
de: Willkommen {firstName}

# pageLoginPassword
source: Your password
de: Ihr Passwort

# pageLoginUsername
source: Your username
de: Ihr Benutzername

source: Smart Translation
de: Intelligente Übersetzung

# smartTranslationDesc
source: Only translates new or changed content, saving API costs
de: Übersetzt nur neue oder geänderte Inhalte und reduziert so die API-Kosten

# specialGreeting
source: Welcome to the future of Flutter i18n!
de: Willkommen in der Zukunft von Flutter i18n!

# subtitle
source: Experience seamless internationalization with automatic Dart code generation
de: Genießen Sie nahtlose Internationalisierung mit der automatischen Dart-Codegenerierung

# testCompleted
source: Translation test completed successfully!
de: Übersetzungstest erfolgreich abgeschlossen!

# welcome
source: Hello
de: Hallo

# welcomeMessage
source: Welcome to Smart ARB Translator!
de: Willkommen beim Smart ARB Translator!
